app/controllers/comments_controller.rb

SELECT * FROM "videos" WHERE ("videos"."id" = 1)
INSERT INTO "comments" ("created_at", "commentable_type", "commentable_id", "updated_at", "username_id", "content") VALUES('2010-04-18 17:19:36', 'Video', 3, '2010-04-18 17:19:36', NULL, 'Hey, get those alapacas away from me!
---
  def create
    @video = Video.find(self.params[:id])
    @comment = @video.comments.build(params[:comment])
    if @comment.save