app/controllers/photos_controller.rb

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def show
    @photo = Photo.find(self.params[:id])

INSERT INTO "photos" ("photo", "created_at", "photo_file_size", "photo_title", "updated_at", "photo_file_name", "photo_description", "photo_content_type", "user_id", "photo_updated_at") VALUES(NULL, '2010-04-08 18:16:19', 272466, 'mao', '2010-04-08 18:16:19', 'untitled.bmp', 'This photo is great for...mao', 'image/bmp', NULL, '2010-04-08 18:16:19')
---
  def create
    @photo = Photo.new(params[:photo_data])
    #@photo.user_id = self.user_session[:user_session]
    @photo.save!