app/controllers/site_root_controller.rb

  def index
    @videos = Video.all
    @photos = Photo.all
    @users = User.all
---
SELECT * FROM "videos"
SELECT * FROM "photos"
SELECT * FROM "users"