app/controllers/users_controller.rb

INSERT INTO "users" ("location", "created_at", "avatar_file_name", "avatar_file_size", "crypted_password", "updated_at", "username", "password_salt", "avatar_content_type", "persistence_token", "bio", "avatar_updated_at", "email") VALUES('', '2010-04-07 05:55:10', NULL, NULL, '3fe2b2a7ab7b360fc5164b5ec9c558d9fc93db35d5ae0113fe812bb468b84aa451f4a3aeb7f9904a6af98463838d63dd841e0ad9a4e14f3161546ec9e80a75ba', '2010-04-07 05:55:10', 'Julie', 'mT1dztaQOVo2E5eSdDOh', NULL, '8da006fd42ac4f3e28fcb0eef2c4fc01f88d9d6e8c50a06d16c69c53d89318b25b6154592be35a02eaeb4e39e9f5f864b2c145d6c4d58497ac103f1d8e767c7c', '', NULL, 'Jfrack@gmail.com')
---
  def create
    #raise self.params.inspect
    @user = User.new(params[:user])
    if @user.save!