app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT * FROM "videos"

  def show
    @video = Video.find(self.params[:id])
---
SELECT * FROM "videos" WHERE ("videos"."id" = 2)

  def create
    @video = Video.new(params[:video_data])
    @video.save!
---
INSERT INTO "videos" ("created_at", "updated_at", "video_description", "video_content_type", "video_file_size", "video_updated_at", "user_id", "video_title", "video_file_name") VALUES('2010-04-08 19:03:39', '2010-04-08 19:03:39', 'alpacas doin what they do', 'video/x-flv', 899596, '2010-04-08 19:03:39', NULL, 'Alpacas', 'alpaca.flv')